app/Http/Controllers/AdminController.php

    public function index_list()
    {
        $admins = User::where('user_role', 'admin')->get();
---
select * from `users` where `user_role` = 'admin'