app/Http/Controllers/ArticleController.php

select count(*) as aggregate from `articles`
---
    public function index()
    {
      $articles = Article::latest()->paginate(5);