app/Http/Controllers/CategorieController.php

    public function index()
    {

        $categorie = Categorie::latest()->where('isDeleted',FALSE)->get();
---
select * from `categories` where `isDeleted` = 0 order by `created_at` desc