app/Http/Controllers/KeywordController.php

    public function index()
    {

       $keyword = Keyword::orderBy('keyword_id', 'desc')->where('isDeleted',FALSE)->get();
---
select * from `keywords` where `isDeleted` = 0 order by `keyword_id` desc