app/Http/Controllers/PlantReferencepageController.php

    public function index()
    {

        $references = DB::table('plant_referencepages')
            ->leftJoin('categories', 'plant_referencepages.plant_categoryid', '=', 'categories.product_categoryid')->where('plant_referencepages.isDeleted',FALSE)->get();
---
select * from `plant_referencepages` left join `categories` on `plant_referencepages`.`plant_categoryid` = `categories`.`product_categoryid` where `plant_referencepages`.`isDeleted` = 0

    public function create()
    {
        $categories =Categorie::latest()->where('isDeleted',FALSE)->get();
---
select * from `categories` where `isDeleted` = 0 order by `created_at` desc