app/Http/Controllers/RetailerApplicationController.php

select * from `retailer_applications` left join `users` on `retailer_applications`.`user_id` = `users`.`id` left join `retailer_approvalstates` on `retailer_applications`.`retailer_approvalstateid` = `retailer_approvalstates`.`retailer_approvalstateid`
---
    public function index()
    {

        $apps = Retailer_application::leftJoin('users', 'retailer_applications.user_id', '=' , 'users.id')
        ->leftJoin('retailer_approvalstates', 'retailer_applications.retailer_approvalstateid', '=' , 'retailer_approvalstates.retailer_approvalstateid')->get();