app/Http/Controllers/UserController.php

select * from `users` order by `created_at` desc
---
    public function index()
    {
        $user = User::latest()->get();