app/Models/Product.php

select * from `product_ratings` where `product_ratings`.`product_id` = 3 and `product_ratings`.`product_id` is not null order by `created_at` desc
---
    public function ratings(){
        return $this->hasMany(ProductRating::class, 'product_id')->latest();